Repository: azicko/deb-glance
Catalog: glance/locale/*/LC_MESSAGES/glance-log-error.po
Languages: fr

source: %s file can not be read.
fr: Le fichier %s ne peut pas etre lu.

source: %s file can not be wrote.
fr: Le fichier %s ne peut pas etre écrit.

source: %s file can not be created.
fr: Le fichier %s ne peut pas etre créé

source: An error occurred reading from backend storage for image %(image_id)s: %(err)s
fr: Une erreur s'est produite pendant le stockage backend de l'image %(image_id)s : %(err)s

source: Backend storage for image %(image_id)s disconnected after writing only %(bytes_written)d bytes
fr: Le stockage d'arrière plan pour l'image %(image_id)s s'est déconnecté après l'écriture de seulement %(bytes_written)d octets

source: An error occurred during image.send notification: %(err)s
fr: Une erreur s'est produite lors de la notification image.send : %(err)s

source: Invalid value for option user_storage_quota: %(users_quota)s
fr: Valeur invalide pour l'option user_storage_quota: %(users_quota)s

source: Image cache contained image file for image '%s', however the registry did not contain metadata for that image!
fr: Le cache d'image contenait un fichier image pour l'image '%s', néanmoins le registre ne contenait pas de métadonnées pour cette image !

source: could not find %s
fr: impossible de trouver %s

source: Checksum header is missing.
fr: L'en-tête de total de contrôle est manquant.

source: Copy from external source '%(scheme)s' failed for image: %(image)s
fr: Echec de copie depuis la source externe '%(scheme)s' pour l'image: %(image)s

source: Unable to kill image %(id)s:
fr: Impossible de supprimer l'image %(id)s :

source: Received HTTP error while uploading image %s
fr: Une erreur HTTP a été reçu lors du chargement de l'image %s

source: Unable to restore image %(image_id)s: %(e)s
fr: Impossible de restaurer l'image %(image_id)s: %(e)s

source: Failed to upload image data due to HTTP error
fr: Echec de téléchargement des données de l'image en raison d'une erreur HTTP

source: Failed to upload image data due to internal error
fr: Echec de téléchargement des données de l'image en raison d'une erreur interne

source: Failed to delete namespace %(namespace)s
fr: Echec lors de la suppresion du namespace %(namespace)s

source: Internal error occurred while trying to process task.
fr: Erreur interne s'est produite lors du traitement de la tâche .

source: Failed to delete image %(image_id)s from store: %(exc)s
fr: Echec de supprésion de l'image %(image_id)s depuis le magasin: %(exc)s

source: Not respawning child %d, cannot recover from termination
fr: Aucune relance de l'enfant %d, récupération impossible après arrêt

source: Task not found for task_id %s
fr: Tache non trouvé pour task_id %s

source: Json schema files not found in %s. Aborting.
fr: Fichier du schéma Json non trouvé dans %s. Abandon.

source: Invalid store uri for image: %(image_id)s. Details: %(reason)s
fr: uri magasin non valide pour image: %(image_id)s. Details: %(reason)s

source: Error executing SQLite call. Got error: %s
fr: Erreur lors de l'exécution de l'appel SQLite. Erreur obtenue : %s

source: The device housing the image cache directory %(image_cache_dir)s does not support xattr. It is likely you need to edit your fstab and add the user_xattr option to the appropriate line for the device housing the cache directory.
fr: L'unité hébergeant le répertoire de cache d'image %(image_cache_dir)s ne prend pas en charge xattr. Vous devez probablement éditer votre fstab et ajouter l'option user_xattr sur la ligne appropriée de l'unité hébergeant le répertoire de cache.

source: Failed to understand rule %s
fr: Échec de compréhension de la règle %s

source: No handler for matches of kind %s
fr: Aucun gestionnaire pour ce type de correspondance %s

source: Unable to get images
fr: Impossible d'obtenir les images.

source: Unable to show image %s
fr: Impossible d'afficher l'image %s

source: Unable to delete image %s
fr: Impossible de supprimer l'image %s

source: Unable to create image %s
fr: Impossible de créer l'image %s

source: Unable to update image %s
fr: Impossible de mettre à jour l'image %s

source: Registry client request %(method)s %(action)s raised %(exc_name)s
fr: Demande client de registre %(method)s %(action)s produite %(exc_name)s

source: Forbidden to create resource type. Reason: %(reason)s
fr: Creation du type de ressource refuse. Raison: %(reason)s
