Repository: azicko/deb-glance
Catalog: debian/po/*.po
Languages: da, de, es, ja, pt_br, sv

source: Pipeline flavor:
da: Pipeline-variant:
de: Pipeline-Variante:
es: Tipo de conexión:
ja: パイプラインの種類:
pt_br: Sabor do pipeline:
sv: Förmedlingstyp:

source: Please specify the flavor of the pipeline to be used by Glance.
ja: Glance で利用するパイプラインの種類を指定してください。

source: If you use the OpenStack Identity Service (Keystone), you might want to select "keystone". If you don't use this service, you can safely choose "caching" only.
da: Hvis du bruger OpenStack Identity Service (Keystone), så vil du måske ønske at vælge »keystone«. Hvis du ikke bruger denne tjeneste, så kan du nøjes med at vælge »caching«.
de: Falls Sie den OpenStack-Identitätsdienst (Keystone) verwenden, möchten Sie möglicherweise »keystone« auswählen. Falls Sie diesen Dienst nicht nutzen, können Sie problemlos nur »caching« auswählen.
es: Si utiliza el Servicio de Identidad de OpenStack (Keystone) es posible que quiera seleccionar «keystone». Si no utiliza este servicio, puede elegir «sólo caché».
ja: OpenStack Identity Service (Keystone) を利用する場合は「keystone」を選択することを推奨します。このサービスを使わない場合は安全のため「caching」だけを選択してください。
pt_br: Se você usa o Serviço de Identidade OpenStack (Keystone), você pode querer selecionar "keystone". Se você não usa esse serviço, você pode escolher seguramente apenas "caching".
sv: Om du använder OpenStack-identitetstjänsten (Keystone) vill du nog välja "keystone". Använder du inte den tjänsten är de säkert att bara välja "caching".

source: Authentication server hostname:
ja: 認証サーバのホスト名:

source: Please specify the hostname of the authentication server for Glance. Typically this is also the hostname of the OpenStack Identity Service (Keystone).
ja: Glance 認証サーバのホスト名を指定してください。これは通常 OpenStack Identity Service (Keystone) のホスト名と同じです。

source: Authentication server tenant name:
ja: 認証サーバのテナント (tenant) 名

source: Please specify the authentication server tenant name.
ja: 認証サーバのテナント (tenant) 名を指定してください。

source: Authentication server username:
ja: 認証サーバのユーザ名:

source: Please specify the username to use with the authentication server.
ja: 認証サーバで使うユーザ名を指定してください。

source: Authentication server password:
ja: 認証サーバのパスワード:

source: Please specify the password to use with the authentication server.
ja: 認証サーバーで使うパスワードを指定してください。

source: Set up a database for Glance?
ja: Glance 用のデータベースを設定しますか?

source: No database has been set up for glance-registry or glance-api to use. Before continuing, you should make sure you have the following information:
ja: glance-registry または glance-api が使用するデータベースが設定されていません。続行する前に、以下の情報が揃っていることを確認する必要があります:

source: * the type of database that you want to use; * the database server hostname (that server must allow TCP connections from this machine); * a username and password to access the database.
ja: * 使いたいデータベースの種類 * データベースサーバのホスト名 (そのサーバは、このマシンからの TCP 接続を 許可する必要があります) * データベースにアクセスするためのユーザ名とパスワード

source: If some of these requirements are missing, do not choose this option and run with regular SQLite support.
ja: 必要な情報が不足している場合は、このオプションを選択しないで、標準の SQLite サポートで実行します。

source: You can change this setting later on by running "dpkg-reconfigure -plow glance-common".
ja: 「dpkg-reconfigure -plow glance-common」を実行することにより、後でこの設定を変更することができます。

source: IP address of your RabbitMQ host:
ja: RabbitMQ ホストの IP アドレス:

source: In order to interoperate with other components of OpenStack, this package needs to connect to a central RabbitMQ server.
ja: OpenStack のほかのコンポーネントと相互運用するためには、このパッケージは中央RabbitMQ サーバに接続する必要があります。

source: Please specify the IP address of that server.
ja: そのサーバの IP アドレスを指定してください。

source: Username for connection to the RabbitMQ server:
ja: RabbitMQ サーバに接続するためのユーザ名:

source: Please specify the username used to connect to the RabbitMQ server.
ja: RabiitMQ サーバに接続するときに使うユーザ名を指定してください。

source: Password for connection to the RabbitMQ server:
ja: RabbitMQ サーバに接続するためのパスワード:

source: Please specify the password used to connect to the RabbitMQ server.
ja: RabbitMQ サーバに接続するときに使うパスワードを指定してください。

source: Register Glance in the Keystone endpoint catalog?
ja: Glance を Keystone のエンドポイントのカタログに登録しますか?

source: Each OpenStack service (each API) should be registered in order to be accessible. This is done using "keystone service-create" and "keystone endpoint-create". This can be done automatically now.
ja: 各 OpenStack のサービス (各 API) がアクセスできるようにするために登録する必要があります。これは「keystone service-create」と「keystone endpoint-create」を使用して行われます。これは自動的に行うことができます。

source: Keystone server IP address:
ja: Keystone サーバの IP アドレス:

source: Please enter the IP address of the Keystone server, so that glance-api can contact Keystone to do the Glance service and endpoint creation.
ja: Keystone サーバの IP アドレスを入力してください。その後 glance-api は Glance サービスやエンドポイント作成のための Keystone との通信が可能になります。

source: Glance endpoint IP address:
da: IP-adresse for Glances slutpunkt:
de: IP-Adresse des Glance-Endpoints:
ja: Glance エンドポイントの IP アドレス:

source: Please enter the IP address that will be used to contact Glance.
ja: Glance との通信に使用される IP アドレスを入力してください。

source: This IP address should be accessible from the clients that will use this service, so if you are installing a public cloud, this should be a public IP address.
da: Denne IP-adresse skal være tilgængelig fra klienterne, som vil bruge denne tjeneste, så hvis du installerer en offentlig sky, skal dette være en offentlig IP-adresse.
de: Diese IP-Adresse sollte von den Clients erreichbar sein, die diesen Dienst nutzen. Falls Sie eine öffentliche Cloud installieren, sollte dies eine öffentliche IP-Adresse sein.
ja: この IP アドレスは、このサービスを利用するクライアントからアクセス可能でなければならないので、パブリッククラウドをインストールしている場合、これはパブリック IP アドレスを使わなければなりません。

source: Name of the region to register:
da: Navn på regionen der skal registreres:
de: Name der zu registrierenden Region:
ja: 登録するリージョンの名前:

source: OpenStack supports using availability zones, with each region representing a location. Please enter the zone that you wish to use when registering the endpoint.
ja: OpenStack は、場所を表すリージョン毎のアベイラビリティーゾーンの使用をサポートしています。エンドポイントを登録する際に使用するゾーンを入力してください。

source: Please specify the flavor of pipeline to be used by Glance.
da: Angiv venligst pipeline-varianten som skal bruges af Glance.
de: Bitte geben Sie die Variante der von Glance zu benutzenden Pipeline an.
es: Especifique el tipo de conexión que debe utilizar Glance.
pt_br: Por favor, especifique o sabor do pipeline a ser usado pelo Glance.
sv: Ange vilken typ av förmedling som ska användas av Glance.

source: Auth server hostname:
da: Værtsnavn for authserver:
de: Rechnername des Authentifizierungsservers:

source: Please specify the URL of your Glance authentication server. Typically this is also the URL of your OpenStack Identity Service (Keystone).
da: Angiv venligst adressen for din godkendelsesserver for Glance. Typisk er dette også adressen for din OpenStack Identity Service (Keystone).
de: Bitte geben Sie die URL des Glance-Authentifizierungsservers an. Typischerweise ist das außerdem die URL Ihres OpenStack-Identitätsdienstes (Keystone).
es: Especifique la URL del servidor de autentificación de Glance. Suele ser la URL del Servicio de Identidad de OpenStack (Keystone).
pt_br: Por favor, especifique a URL do seu servidor de autenticação Glance. Tipicamente, essa é também a URL do seu Serviço de Identidade OpenStack (Keystone).
sv: Ange URL till din Glance-identifieringsserver. Detta är vanligtvis samma URL som till din OpenStack-identitetstjänst (Keystone).

source: Auth server tenant name:
da: Lejenavn (tenant) for authserver:
de: Tentant-Name des Authentifizierungsservers:

source: Auth server username:
da: Brugernavn for authserver:
de: Benutzername für den Authentifizierungsserver:

source: Auth server password:
da: Adgangskode for authserver:
de: Passwort für den Authentifizierungsserver:

source: Set up a database for glance?
da: Opsæt en database for glance?
de: Eine Datenbank für Glance einrichten?

source: No database has been set up for glance-registry or glance-api to use. Before continuing, you should make sure you have:
da: Ingen database er blevet opsat som glance-registry eller glance-api kan bruge. Før du fortsætter, skal du sikre dig at du har:
de: Es wurde keine Datenbank für die Benutzung mit der Glance-Registry oder des Glance-API eingerichtet. Bevor Sie fortfahren, sollten Sie sicherstellen, dass Sie Folgendes haben:

source: - the server host name (that server must allow TCP connections from this machine); - a username and password to access the database. - A database type that you want to use.
da: - serverens værtsnavn (denne server skal tillade TCP-forbindelser fra denne maskine) - et brugernavn og adgangskode til at tilgå databasen - en databasetype som du ønsker at bruge
de: - den Rechnernamen des Servers (dieser Server muss TCP-Verbindungen von diesem Rechner erlauben) - einen Benutzernamen und ein Passwort, um auf die Datenbank zuzugreifen - einen Datenbaktyp, den Sie verwenden möchten

source: If some of these requirements are missing, reject this option and run with regular sqlite support.
da: Hvis nogle af disse krav mangler så afvis denne indstilling og kør med normal sqlite-understøttelse.
de: Falls einige dieser Anforderungen nicht erfüllt sind, lehnen Sie diese Option ab und verwenden Sie die normale Sqlite-Unterstützung.
es: Si no dispone de alguno de estos datos, seleccione «no» en este apartado y ejecute Glance con soporte para sqlite.
pt_br: Se algum desses requisitos estiver faltando, rejeite essa opção e execute com suporte regular ao sqlite.
sv: Om något av dessa krav saknar bör du avböja detta alternativ och fortsätta använda sqlite-stödet.

source: You can change this setting later on by running 'dpkg-reconfigure -plow glance-common'.
da: Du kan ændre denne indstilling senere ved at køre »dpkg-reconfigure -plow glance-common«.
de: Sie können diese Einstellung später ändern, indem Sie »dpkg-reconfigure -plow glance-common« ausführen.

source: Register Glance in the keystone endpoint catalog?
da: Registrer Glance i Keystones slutpunktskatalog?
de: Glance im Keystone-Endpoint-Katalog registrieren?

source: Each Openstack services (each API) should be registered in order to be accessible. This is done using "keystone service-create" and "keystone endpoint-create". Select if you want to run these commands now.
da: Hver Openstacktjeneste (hver API) skal være registreret for at kunne tilgås. Dette gøres med »keystone service-create« og »keystone endpoint-create«. Vælg om du vil køre disse kommandoer nu.
de: Alle Openstack-Dienste (jedes API) sollten registriert werden, damit auf sie zugegriffen werden kann. Dies wird mittels »keystone service-create« und »keystone endpoint-create« erledigt. Wählen Sie aus, ob Sie diese Befehle nun ausführen möchten.

source: Note that you will need to have an up and running keystone server on which to connect using the Keystone auth token.
da: Bemærk at du skal have en op og kørende Keystoneserver, som du skal forbinde til med Keystones godkendelsessymbol.
de: Beachten Sie, dass Sie einen laufenden Keystone-Server benötigen, mit dem Sie sich unter Nutzung des Keystone-Authentifizierungs-Tokens verbinden können.

source: Keystone IP address:
da: IP-adresse for Keystoneserver:
de: IP-Adresse von Keystone:

source: Enter the IP address of your keystone server, so that glance-api can contact Keystone to do the Glance service and endpoint creation.
da: Indtast venligst IP-adressen for Keystoneserveren, så at glance-api kan kontakte Keystone for at udføre Glancetjenesten og slutpunktsoprettelse.
de: Geben Sie bitte die IP-Adresse des Keystone-Servers an, damit Glance-api Keystone kontaktieren kann, um den Glance-Dienst und -Endpoint zu erstellen.

source: Keystone Auth Token:
da: Godkendelsessymbol for Keystone:
de: Keystone-Authentifizierungs-Token:

source: To configure its endpoint in Keystone, glance-api needs the Keystone auth token.
da: For at konfigurere dets slutpunkt i Keystone, kræver glance-api Keystones godkendelsessymbol.
de: Um seinen Keystone-Endpoint einzurichten, benötigt Glance-api das Keystone-Authentifizierungs-Token.

source: Enter the IP address that will be used to contact Glance (eg: the Glance endpoint IP address).
da: Indtast venligst IP-adressen som vil blive brugt til at kontakte Glance (f.eks. IP-adresse for Glanceslutpunktet).
de: Geben Sie bitte die IP-Adresse an, die für den Kontakt mit Glance benutzt wird (z.B. die IP-Adresse des Glance-Endpoints).

source: Openstack can be used using availability zones, with each region representing a location. Please enter the zone that you wish to use when registering the endpoint.
da: OpenStack understøtter brug af tilgængelighedszoner, hvor hver region repræsenterer et sted. Indtast venligst zonen du ønsker at bruge, når slutpunktet registreres.
de: OpenStack unterstützt verfügbare Zonen, in denen jede Region einen Ort darstellt. Geben Sie bitte die Zone an, die Sie bei der Registrierung des Endpoints verwenden wollen.

source: Set up a database for glance-registry?
es: ¿Desea configurar una base de datos para «glance-registry»?
pt_br: Configurar um banco de dados para o glance-registry?
sv: Ska inställningar för glance-registry-databasen göras?

source: No database has been set up for glance-registry to use. Before continuing, you should make sure you have:
es: No se ha configurado ninguna base de datos para «glance-registry». Antes de continuar debe asegurarse de que dispone de la siguiente información:
pt_br: Nenhum banco de dados foi configurado para o glance-registry usar. Antes de continuar, você deve se certificar que você tem:
sv: Det finns inga inställningar för databas för glance-registry. Innan du bör du ha följande till hands:

source: - the server host name (that server must allow TCP connections from this machine); - a username and password to access the database. - A database type that you want to use.
es: - El nombre del servidor (el servidor debe permitir conexiones TCP desde este equipo). - El nombre de usuario y la contraseña para acceder a la base de datos. - El tipo de base de datos que quiere utilizar.
pt_br: - o nome do servidor (tal servidor deve permitir conexões TCP a partir deste computador); - um usuário e uma senha para acessar o banco de dados; - o tipo de banco de dados que você quer utilizar.
sv: - serverns värdnamn (som måste kunna ta emot TCP-anslutningar från den här maskinen) - att användarnamn och lösenord för att komma åt databasen. - Vilken databastyp du vill använda.

source: You can change this setting later on by running 'dpkg-reconfigure -plow glance-registry
es: Podrá cambiar esta configuración más adelante ejecutando «dpkg-reconfigure -plow glance-registry»
pt_br: Você pode mudar essa configuração depois, executando 'dpkg-reconfigure -plow glance-registry'
sv: Denna inställning kan ändras senare genom att köra "dpkg-reconfigure -plow glance-registry"

source: Auth server URL:
es: URL del servidor de autentificación:
pt_br: URL para o servidor de autenticação:
sv: URL till identifieringsserver:

source: Auth server admin token:
es: Token de administración del servidor de autentificación:
pt_br: Token admin do servidor de autenticação:
sv: Identifieringsserverns adminstrationsidentitet:
